Revit 2026 API

# AssemblyInstanceSetMemberIds Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetMemberIds(
	ICollection<ElementId> memberIds
)
```
```vb
Public Sub SetMemberIds (
	memberIds As ICollection(Of ElementId)
)
```
```cpp
public:
void SetMemberIds(
	ICollection<ElementId^>^ memberIds
)
```
```fsharp
member SetMemberIds :
        memberIds : ICollection<ElementId> -> unit
```

#### Parameters

memberIds ICollectionElementId

#### Reference

AssemblyInstance Class

Autodesk.Revit.DB Namespace